{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "torch", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 128, 384, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "keras_cv>ImageClassifier", "config": {"name": "classifier", "trainable": true, "backbone": {"module": "keras_cv.src.models.backbones.efficientnet_v2.efficientnet_v2_backbone", "class_name": "EfficientNetV2Backbone", "config": {"name": "efficient_net_v2b2_backbone", "trainable": true, "include_rescaling": true, "width_coefficient": 1.1, "depth_coefficient": 1.2, "skip_connection_dropout": 0.2, "depth_divisor": 8, "min_depth": 8, "activation": "swish", "input_shape": [null, null, 3], "input_tensor": null, "stackwise_kernel_sizes": [3, 3, 3, 3, 3, 3], "stackwise_num_repeats": [1, 2, 2, 3, 5, 8], "stackwise_input_filters": [32, 16, 32, 48, 96, 112], "stackwise_output_filters": [16, 32, 48, 96, 112, 192], "stackwise_expansion_ratios": [1, 4, 4, 4, 6, 6], "stackwise_squeeze_and_excite_ratios": [0, 0, 0, 0.25, 0.25, 0.25], "stackwise_strides": [1, 2, 2, 2, 1, 2], "stackwise_conv_types": ["fused", "fused", "fused", "unfused", "unfused", "unfused"]}, "registered_name": "keras_cv>EfficientNetV2Backbone", "build_config": {"input_shape": null}}, "num_classes": 182, "pooling": "avg", "activation": "softmax"}, "name": "classifier", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 384, 3], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {"mask": null}}]}], "input_layers": [["input_layer", 0, 0]], "output_layers": [["classifier", 1, 0]]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"name": "categorical_crossentropy", "reduction": "sum_over_batch_size", "from_logits": false, "label_smoothing": 0.02, "axis": -1}}, "loss_weights": null, "metrics": [{"class_name": "AUC", "config": {"name": "auc", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_labels": null, "label_weights": null, "from_logits": false}}], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": false, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of9.bin", "group1-shard2of9.bin", "group1-shard3of9.bin", "group1-shard4of9.bin", "group1-shard5of9.bin", "group1-shard6of9.bin", "group1-shard7of9.bin", "group1-shard8of9.bin", "group1-shard9of9.bin"], "weights": [{"name": "stem_conv/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "stem_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "stem_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block1a_/block1a_project_conv/kernel", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "block1a_/block1a_project_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "block1a_/block1a_project_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "block1b_/block1b_project_conv/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "block1b_/block1b_project_bn/gamma", "shape": [16], "dtype": "float32"}, {"name": "block1b_/block1b_project_bn/beta", "shape": [16], "dtype": "float32"}, {"name": "block2a_/block2a_expand_conv/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "block2a_/block2a_expand_bn/gamma", "shape": [64], "dtype": "float32"}, {"name": "block2a_/block2a_expand_bn/beta", "shape": [64], "dtype": "float32"}, {"name": "block2a_/block2a_project_conv/kernel", "shape": [1, 1, 64, 32], "dtype": "float32"}, {"name": "block2a_/block2a_project_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block2a_/block2a_project_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block2b_/block2b_expand_conv/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "block2b_/block2b_expand_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "block2b_/block2b_expand_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "block2b_/block2b_project_conv/kernel", "shape": [1, 1, 128, 32], "dtype": "float32"}, {"name": "block2b_/block2b_project_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block2b_/block2b_project_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block2c_/block2c_expand_conv/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "block2c_/block2c_expand_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "block2c_/block2c_expand_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "block2c_/block2c_project_conv/kernel", "shape": [1, 1, 128, 32], "dtype": "float32"}, {"name": "block2c_/block2c_project_bn/gamma", "shape": [32], "dtype": "float32"}, {"name": "block2c_/block2c_project_bn/beta", "shape": [32], "dtype": "float32"}, {"name": "block3a_/block3a_expand_conv/kernel", "shape": [3, 3, 32, 128], "dtype": "float32"}, {"name": "block3a_/block3a_expand_bn/gamma", "shape": [128], "dtype": "float32"}, {"name": "block3a_/block3a_expand_bn/beta", "shape": [128], "dtype": "float32"}, {"name": "block3a_/block3a_project_conv/kernel", "shape": [1, 1, 128, 56], "dtype": "float32"}, {"name": "block3a_/block3a_project_bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3a_/block3a_project_bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block3b_/block3b_expand_conv/kernel", "shape": [3, 3, 56, 224], "dtype": "float32"}, {"name": "block3b_/block3b_expand_bn/gamma", "shape": [224], "dtype": "float32"}, {"name": "block3b_/block3b_expand_bn/beta", "shape": [224], "dtype": "float32"}, {"name": "block3b_/block3b_project_conv/kernel", "shape": [1, 1, 224, 56], "dtype": "float32"}, {"name": "block3b_/block3b_project_bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3b_/block3b_project_bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block3c_/block3c_expand_conv/kernel", "shape": [3, 3, 56, 224], "dtype": "float32"}, {"name": "block3c_/block3c_expand_bn/gamma", "shape": [224], "dtype": "float32"}, {"name": "block3c_/block3c_expand_bn/beta", "shape": [224], "dtype": "float32"}, {"name": "block3c_/block3c_project_conv/kernel", "shape": [1, 1, 224, 56], "dtype": "float32"}, {"name": "block3c_/block3c_project_bn/gamma", "shape": [56], "dtype": "float32"}, {"name": "block3c_/block3c_project_bn/beta", "shape": [56], "dtype": "float32"}, {"name": "block4a_/block4a_expand_conv/kernel", "shape": [1, 1, 56, 224], "dtype": "float32"}, {"name": "block4a_/block4a_expand_bn/gamma", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_expand_bn/beta", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_dwconv2/kernel", "shape": [3, 3, 224, 1], "dtype": "float32"}, {"name": "block4a_/block4a_bn/gamma", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_bn/beta", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_se_reduce/kernel", "shape": [1, 1, 224, 14], "dtype": "float32"}, {"name": "block4a_/block4a_se_reduce/bias", "shape": [14], "dtype": "float32"}, {"name": "block4a_/block4a_se_expand/kernel", "shape": [1, 1, 14, 224], "dtype": "float32"}, {"name": "block4a_/block4a_se_expand/bias", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_project_conv/kernel", "shape": [1, 1, 224, 104], "dtype": "float32"}, {"name": "block4a_/block4a_project_bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4a_/block4a_project_bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4b_/block4b_expand_conv/kernel", "shape": [1, 1, 104, 416], "dtype": "float32"}, {"name": "block4b_/block4b_expand_bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_expand_bn/beta", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_dwconv2/kernel", "shape": [3, 3, 416, 1], "dtype": "float32"}, {"name": "block4b_/block4b_bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_bn/beta", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_se_reduce/kernel", "shape": [1, 1, 416, 26], "dtype": "float32"}, {"name": "block4b_/block4b_se_reduce/bias", "shape": [26], "dtype": "float32"}, {"name": "block4b_/block4b_se_expand/kernel", "shape": [1, 1, 26, 416], "dtype": "float32"}, {"name": "block4b_/block4b_se_expand/bias", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_project_conv/kernel", "shape": [1, 1, 416, 104], "dtype": "float32"}, {"name": "block4b_/block4b_project_bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4b_/block4b_project_bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4c_/block4c_expand_conv/kernel", "shape": [1, 1, 104, 416], "dtype": "float32"}, {"name": "block4c_/block4c_expand_bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_expand_bn/beta", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_dwconv2/kernel", "shape": [3, 3, 416, 1], "dtype": "float32"}, {"name": "block4c_/block4c_bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_bn/beta", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_se_reduce/kernel", "shape": [1, 1, 416, 26], "dtype": "float32"}, {"name": "block4c_/block4c_se_reduce/bias", "shape": [26], "dtype": "float32"}, {"name": "block4c_/block4c_se_expand/kernel", "shape": [1, 1, 26, 416], "dtype": "float32"}, {"name": "block4c_/block4c_se_expand/bias", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_project_conv/kernel", "shape": [1, 1, 416, 104], "dtype": "float32"}, {"name": "block4c_/block4c_project_bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4c_/block4c_project_bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block4d_/block4d_expand_conv/kernel", "shape": [1, 1, 104, 416], "dtype": "float32"}, {"name": "block4d_/block4d_expand_bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_expand_bn/beta", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_dwconv2/kernel", "shape": [3, 3, 416, 1], "dtype": "float32"}, {"name": "block4d_/block4d_bn/gamma", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_bn/beta", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_se_reduce/kernel", "shape": [1, 1, 416, 26], "dtype": "float32"}, {"name": "block4d_/block4d_se_reduce/bias", "shape": [26], "dtype": "float32"}, {"name": "block4d_/block4d_se_expand/kernel", "shape": [1, 1, 26, 416], "dtype": "float32"}, {"name": "block4d_/block4d_se_expand/bias", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_project_conv/kernel", "shape": [1, 1, 416, 104], "dtype": "float32"}, {"name": "block4d_/block4d_project_bn/gamma", "shape": [104], "dtype": "float32"}, {"name": "block4d_/block4d_project_bn/beta", "shape": [104], "dtype": "float32"}, {"name": "block5a_/block5a_expand_conv/kernel", "shape": [1, 1, 104, 624], "dtype": "float32"}, {"name": "block5a_/block5a_expand_bn/gamma", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_expand_bn/beta", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_dwconv2/kernel", "shape": [3, 3, 624, 1], "dtype": "float32"}, {"name": "block5a_/block5a_bn/gamma", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_bn/beta", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_se_reduce/kernel", "shape": [1, 1, 624, 26], "dtype": "float32"}, {"name": "block5a_/block5a_se_reduce/bias", "shape": [26], "dtype": "float32"}, {"name": "block5a_/block5a_se_expand/kernel", "shape": [1, 1, 26, 624], "dtype": "float32"}, {"name": "block5a_/block5a_se_expand/bias", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_project_conv/kernel", "shape": [1, 1, 624, 120], "dtype": "float32"}, {"name": "block5a_/block5a_project_bn/gamma", "shape": [120], "dtype": "float32"}, {"name": "block5a_/block5a_project_bn/beta", "shape": [120], "dtype": "float32"}, {"name": "block5b_/block5b_expand_conv/kernel", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "block5b_/block5b_expand_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_expand_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_dwconv2/kernel", "shape": [3, 3, 720, 1], "dtype": "float32"}, {"name": "block5b_/block5b_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_se_reduce/kernel", "shape": [1, 1, 720, 30], "dtype": "float32"}, {"name": "block5b_/block5b_se_reduce/bias", "shape": [30], "dtype": "float32"}, {"name": "block5b_/block5b_se_expand/kernel", "shape": [1, 1, 30, 720], "dtype": "float32"}, {"name": "block5b_/block5b_se_expand/bias", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_project_conv/kernel", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "block5b_/block5b_project_bn/gamma", "shape": [120], "dtype": "float32"}, {"name": "block5b_/block5b_project_bn/beta", "shape": [120], "dtype": "float32"}, {"name": "block5c_/block5c_expand_conv/kernel", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "block5c_/block5c_expand_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_expand_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_dwconv2/kernel", "shape": [3, 3, 720, 1], "dtype": "float32"}, {"name": "block5c_/block5c_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_se_reduce/kernel", "shape": [1, 1, 720, 30], "dtype": "float32"}, {"name": "block5c_/block5c_se_reduce/bias", "shape": [30], "dtype": "float32"}, {"name": "block5c_/block5c_se_expand/kernel", "shape": [1, 1, 30, 720], "dtype": "float32"}, {"name": "block5c_/block5c_se_expand/bias", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_project_conv/kernel", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "block5c_/block5c_project_bn/gamma", "shape": [120], "dtype": "float32"}, {"name": "block5c_/block5c_project_bn/beta", "shape": [120], "dtype": "float32"}, {"name": "block5d_/block5d_expand_conv/kernel", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "block5d_/block5d_expand_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_expand_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_dwconv2/kernel", "shape": [3, 3, 720, 1], "dtype": "float32"}, {"name": "block5d_/block5d_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_se_reduce/kernel", "shape": [1, 1, 720, 30], "dtype": "float32"}, {"name": "block5d_/block5d_se_reduce/bias", "shape": [30], "dtype": "float32"}, {"name": "block5d_/block5d_se_expand/kernel", "shape": [1, 1, 30, 720], "dtype": "float32"}, {"name": "block5d_/block5d_se_expand/bias", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_project_conv/kernel", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "block5d_/block5d_project_bn/gamma", "shape": [120], "dtype": "float32"}, {"name": "block5d_/block5d_project_bn/beta", "shape": [120], "dtype": "float32"}, {"name": "block5e_/block5e_expand_conv/kernel", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "block5e_/block5e_expand_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_expand_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_dwconv2/kernel", "shape": [3, 3, 720, 1], "dtype": "float32"}, {"name": "block5e_/block5e_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_se_reduce/kernel", "shape": [1, 1, 720, 30], "dtype": "float32"}, {"name": "block5e_/block5e_se_reduce/bias", "shape": [30], "dtype": "float32"}, {"name": "block5e_/block5e_se_expand/kernel", "shape": [1, 1, 30, 720], "dtype": "float32"}, {"name": "block5e_/block5e_se_expand/bias", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_project_conv/kernel", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "block5e_/block5e_project_bn/gamma", "shape": [120], "dtype": "float32"}, {"name": "block5e_/block5e_project_bn/beta", "shape": [120], "dtype": "float32"}, {"name": "block5f_/block5f_expand_conv/kernel", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "block5f_/block5f_expand_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_expand_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_dwconv2/kernel", "shape": [3, 3, 720, 1], "dtype": "float32"}, {"name": "block5f_/block5f_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_se_reduce/kernel", "shape": [1, 1, 720, 30], "dtype": "float32"}, {"name": "block5f_/block5f_se_reduce/bias", "shape": [30], "dtype": "float32"}, {"name": "block5f_/block5f_se_expand/kernel", "shape": [1, 1, 30, 720], "dtype": "float32"}, {"name": "block5f_/block5f_se_expand/bias", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_project_conv/kernel", "shape": [1, 1, 720, 120], "dtype": "float32"}, {"name": "block5f_/block5f_project_bn/gamma", "shape": [120], "dtype": "float32"}, {"name": "block5f_/block5f_project_bn/beta", "shape": [120], "dtype": "float32"}, {"name": "block6a_/block6a_expand_conv/kernel", "shape": [1, 1, 120, 720], "dtype": "float32"}, {"name": "block6a_/block6a_expand_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_expand_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_dwconv2/kernel", "shape": [3, 3, 720, 1], "dtype": "float32"}, {"name": "block6a_/block6a_bn/gamma", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_bn/beta", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_se_reduce/kernel", "shape": [1, 1, 720, 30], "dtype": "float32"}, {"name": "block6a_/block6a_se_reduce/bias", "shape": [30], "dtype": "float32"}, {"name": "block6a_/block6a_se_expand/kernel", "shape": [1, 1, 30, 720], "dtype": "float32"}, {"name": "block6a_/block6a_se_expand/bias", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_project_conv/kernel", "shape": [1, 1, 720, 208], "dtype": "float32"}, {"name": "block6a_/block6a_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6a_/block6a_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6b_/block6b_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6b_/block6b_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6b_/block6b_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6b_/block6b_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6b_/block6b_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6b_/block6b_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6b_/block6b_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6b_/block6b_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6c_/block6c_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6c_/block6c_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6c_/block6c_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6c_/block6c_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6c_/block6c_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6c_/block6c_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6c_/block6c_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6c_/block6c_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6d_/block6d_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6d_/block6d_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6d_/block6d_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6d_/block6d_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6d_/block6d_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6d_/block6d_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6d_/block6d_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6d_/block6d_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6e_/block6e_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6e_/block6e_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6e_/block6e_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6e_/block6e_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6e_/block6e_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6e_/block6e_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6e_/block6e_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6e_/block6e_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6f_/block6f_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6f_/block6f_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6f_/block6f_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6f_/block6f_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6f_/block6f_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6f_/block6f_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6f_/block6f_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6f_/block6f_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6g_/block6g_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6g_/block6g_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6g_/block6g_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6g_/block6g_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6g_/block6g_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6g_/block6g_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6g_/block6g_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6g_/block6g_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6h_/block6h_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6h_/block6h_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6h_/block6h_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6h_/block6h_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6h_/block6h_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6h_/block6h_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6h_/block6h_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6h_/block6h_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6i_/block6i_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6i_/block6i_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6i_/block6i_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6i_/block6i_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6i_/block6i_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6i_/block6i_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6i_/block6i_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6i_/block6i_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "block6j_/block6j_expand_conv/kernel", "shape": [1, 1, 208, 1248], "dtype": "float32"}, {"name": "block6j_/block6j_expand_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_expand_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_dwconv2/kernel", "shape": [3, 3, 1248, 1], "dtype": "float32"}, {"name": "block6j_/block6j_bn/gamma", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_bn/beta", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_se_reduce/kernel", "shape": [1, 1, 1248, 52], "dtype": "float32"}, {"name": "block6j_/block6j_se_reduce/bias", "shape": [52], "dtype": "float32"}, {"name": "block6j_/block6j_se_expand/kernel", "shape": [1, 1, 52, 1248], "dtype": "float32"}, {"name": "block6j_/block6j_se_expand/bias", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_project_conv/kernel", "shape": [1, 1, 1248, 208], "dtype": "float32"}, {"name": "block6j_/block6j_project_bn/gamma", "shape": [208], "dtype": "float32"}, {"name": "block6j_/block6j_project_bn/beta", "shape": [208], "dtype": "float32"}, {"name": "top_conv/kernel", "shape": [1, 1, 208, 1408], "dtype": "float32"}, {"name": "top_bn/gamma", "shape": [1408], "dtype": "float32"}, {"name": "top_bn/beta", "shape": [1408], "dtype": "float32"}, {"name": "predictions/kernel", "shape": [1408, 182], "dtype": "float32"}, {"name": "predictions/bias", "shape": [182], "dtype": "float32"}, {"name": "stem_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "stem_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block1a_/block1a_project_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block1a_/block1a_project_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block1b_/block1b_project_bn/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "block1b_/block1b_project_bn/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "block2a_/block2a_expand_bn/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "block2a_/block2a_expand_bn/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "block2a_/block2a_project_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block2a_/block2a_project_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block2b_/block2b_expand_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "block2b_/block2b_expand_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "block2b_/block2b_project_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block2b_/block2b_project_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block2c_/block2c_expand_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "block2c_/block2c_expand_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "block2c_/block2c_project_bn/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "block2c_/block2c_project_bn/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "block3a_/block3a_expand_bn/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "block3a_/block3a_expand_bn/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "block3a_/block3a_project_bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3a_/block3a_project_bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block3b_/block3b_expand_bn/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "block3b_/block3b_expand_bn/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "block3b_/block3b_project_bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3b_/block3b_project_bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block3c_/block3c_expand_bn/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "block3c_/block3c_expand_bn/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "block3c_/block3c_project_bn/moving_mean", "shape": [56], "dtype": "float32"}, {"name": "block3c_/block3c_project_bn/moving_variance", "shape": [56], "dtype": "float32"}, {"name": "block4a_/block4a_expand_bn/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_expand_bn/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_bn/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_bn/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "block4a_/block4a_project_bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4a_/block4a_project_bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4b_/block4b_expand_bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_expand_bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "block4b_/block4b_project_bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4b_/block4b_project_bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4c_/block4c_expand_bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_expand_bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "block4c_/block4c_project_bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4c_/block4c_project_bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block4d_/block4d_expand_bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_expand_bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_bn/moving_mean", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_bn/moving_variance", "shape": [416], "dtype": "float32"}, {"name": "block4d_/block4d_project_bn/moving_mean", "shape": [104], "dtype": "float32"}, {"name": "block4d_/block4d_project_bn/moving_variance", "shape": [104], "dtype": "float32"}, {"name": "block5a_/block5a_expand_bn/moving_mean", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_expand_bn/moving_variance", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_bn/moving_mean", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_bn/moving_variance", "shape": [624], "dtype": "float32"}, {"name": "block5a_/block5a_project_bn/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "block5a_/block5a_project_bn/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "block5b_/block5b_expand_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_expand_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5b_/block5b_project_bn/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "block5b_/block5b_project_bn/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "block5c_/block5c_expand_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_expand_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5c_/block5c_project_bn/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "block5c_/block5c_project_bn/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "block5d_/block5d_expand_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_expand_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5d_/block5d_project_bn/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "block5d_/block5d_project_bn/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "block5e_/block5e_expand_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_expand_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5e_/block5e_project_bn/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "block5e_/block5e_project_bn/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "block5f_/block5f_expand_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_expand_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block5f_/block5f_project_bn/moving_mean", "shape": [120], "dtype": "float32"}, {"name": "block5f_/block5f_project_bn/moving_variance", "shape": [120], "dtype": "float32"}, {"name": "block6a_/block6a_expand_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_expand_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_bn/moving_mean", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_bn/moving_variance", "shape": [720], "dtype": "float32"}, {"name": "block6a_/block6a_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6a_/block6a_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6b_/block6b_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6b_/block6b_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6b_/block6b_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6c_/block6c_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6c_/block6c_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6c_/block6c_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6d_/block6d_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6d_/block6d_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6d_/block6d_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6e_/block6e_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6e_/block6e_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6e_/block6e_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6f_/block6f_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6f_/block6f_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6f_/block6f_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6g_/block6g_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6g_/block6g_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6g_/block6g_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6h_/block6h_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6h_/block6h_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6h_/block6h_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6i_/block6i_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6i_/block6i_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6i_/block6i_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "block6j_/block6j_expand_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_expand_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_bn/moving_mean", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_bn/moving_variance", "shape": [1248], "dtype": "float32"}, {"name": "block6j_/block6j_project_bn/moving_mean", "shape": [208], "dtype": "float32"}, {"name": "block6j_/block6j_project_bn/moving_variance", "shape": [208], "dtype": "float32"}, {"name": "top_bn/moving_mean", "shape": [1408], "dtype": "float32"}, {"name": "top_bn/moving_variance", "shape": [1408], "dtype": "float32"}]}]}